Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] WEBTOON KO>EN PSYCHIC STUDIES.tmx
Source language: ko
Languages: en

source: 난 너처럼 스스로의 생각에 당당하지 못한 사람은 아니라서
en: besides, I’m confident about my thoughts, unlike you.

source: 월 화 수 목 금
en: M T W TH F

source: 그냥 슬리퍼 신고 다니지 뭐.
en: I’ll just wear my slippers.

source: 별로!
en: no!

source: 안나
en: no.

source: 그래.
en: yeah.

source: 급발진
en: WHOOSH

source: 네 아버지 말이야
en: your father.

source: 아직은 별문제가 없지만, 저렇게 나오는 것을 봐선 무슨 짓을 해올게 뻔해
en: there aren’t any problems yet, but judging from her behavior, they definitely have a trick up their sleeve.

source: 히히…!!
en: heehee!!!

source: 나도 별 생각 없었는데 이신 그 자식이 너무 긁어댔다고∙∙∙ !
en: I didn’t think much of it either, but that jerk was way too annoying!

source: 네 영력도 가져갈게
en: I’ll need your spiritual energy too.

source: 너 맨발이네!!
en: you’re not wearing socks!

source: 혜진 경익
en: and Hyejin Gyeong-ik

source: 왜.
en: what?

source: 별 일 아니야 이제 신경 안 쓰기로 했어
en: it’s nothing. I agreed not to meddle in her business.

source: 근데 사실 그렇지도 않어
en: but it really isn’t.

source: 아빠가 미안해
en: daddy’s sorry.

source: 저게 또…
en: he’s at it again...

source: 나랑 깨진 썸남도 거기잖아 ㅆㅂ
en: I broke up with one of the boys there. sh*t...

source: 위이!!
en: up there!!!

source: 4 미
en: 4 Ar

source: 얘요
en: him!

source: 계속 내 생각을…
en: stop reading my thoughts...

source: 어딨어!
en: where is he?

source: 내 정신머리 같은 건 그다지 중요하지 않아
en: it doesn’t matter if I’m a nutcase or not.

source: 지도 친구 일이라면 멋대로 해놓고, 어디 두고 보라고.
en: as someone who’d always step forward herself, how dare euijoo tell me to mind my own business?!

source: 이번에 새로 들어온다는 사람이…
en: so the new member...

source: 내가 말했던가?
en: did I tell him?

source: 여의주는 용의 눈이에요
en: euijoo yeo is the dragon’s eyes...

source: 야 이 그지들아
en: you freeloaders!

source: 안돼!!
en: no!!!

source: 태희야 제발 도와줘!!
en: taehee! please help!!!

source: 나 가볼게~ 상처 잘 낫구!!
en: I have to go. hope you get better soon!!!

source: 시간 돌릴 수 있다며 별로면 갈아치워 ㅎ
en: you can turn back time. if you don’t like the boy, just go back and date someone else, haha.

source: 왜 나라고 하니까 바로 런하는데!!
en: why are you running as soon as I said it’s me?!

source: 너네 아버지께 감사해
en: I’m grateful for your father.

source: 다가오지…
en: please...

source: 엽덕 매운맛 나왔습니다~
en: here’s your extra spicy tteokbokki.

source: 박동혁 서재영 선경 켱개
en: Donghyuk Park, Jaeyong Seo, Seongyeong, Kyeonggae,

source: 이의있음!
en: objection!

source: 멀쩡하네 ㅂ신
en: the fool’s fine.

source: 저기 쓰레… 아니, 친구야!
en: hey, garba- I mean, friend!

source: 사랑한다
en: I love you.

source: 헉
en: huff!

source: 상담실까지 찾아올건 아니지
en: you didn’t have to go to the counseling office.

source: 자- 한 번 더 시간을 돌려.
en: so, turn time back one last time.

source: 야~ 남친이면 좀 챙겨!
en: hey, mr. boyfriend! take good care of her, will you?

source: 야, 야.
en: hey, hey.

source: 야...
en: hey...

source: 인연은 상담에서…
en: my fated encounter is here...

source: 개시해 보자구
en: ...put our plan into action.

source: 뭐어?
en: ha!

source: ㅈ까
en: f*ck off.

source: 여러분이 제일 기대한 부분이죠?
en: ...is what you all have been waiting for!

source: 날
en: you will...

source: 용의 능력은 서로를 끌어당겨요
en: the dragon’s powers attract each other...

source: 의주는 부스 도와주러 가서 어쩔 수 없어~
en: besides, euijoo is helping at her booth, so I’d be alone otherwise.

source: 아니야
en: no.

source: 아니 저게 말이라고 말 되게하네
en: what kind of nonsense is she spewing?!

source: 불쾌~
en: UGH

source: 과거로 보내도 보내진 사람이 기억을 못 해!
en: she can send a person back in time, but that person can’t remember anything!

source: 유도부에 진주라고 오늘 시합 끝나면 내가 한턱 쏘기로 했거든…ㅠ
en: pearl’s my friend in the judo club. I promised to treat her today after her tournament...

source: 왜?
en: why?

source: 깜짝이야 왜 저래?
en: what the- what’s wrong with him?

source: 히익!!
en: eek!!!

source: 와 씨 망했다 하필 그걸 까먹었냐… 나 친구 실격이다…
en: damnit... I’m screwed. why’d I have to forget that of all things? I’m a terrible friend...

source: 어 나야
en: yeah, it’s me.

source: 김우찬∙∙∙ ∙∙∙ .
en: woochan...

source: 아니 그니까 그런 거 안 한다니…
en: I said I don’t want that kind of thing...

source: 얜 그냥 호기심이고 무책임 하다구요!
en: she’s just curious and isn’t being serious about this!

source: 울고 있잖아
en: she’s crying.

source: 어떻게 알았어?
en: how did you know?

source: …?{j}근데 갑자기 왜?
en: hm? why do you ask all of a sudden?{j}

source: 니가 뭘 안다고 그래?
en: you don’t know anything!

source: 너 무슨 부 라고?
en: which club did you say you’re in?

source: 너 이…!
en: you little-!

source: 나랑 찬규님 영력도 갑자기 강해졌는데…?
en: my spiritual energy is suddenly stronger too... same with master chankyu’s!

source: 넌 꺼져
en: get lost.

source: 지…진주야…!!!
en: p-pearl!!!

source: 스륵
en: SLIP

source: 이제 좀 속이 시원하겠네
en: finally, I feel so much better.

source: 아뇨!!
en: no!

source: 김우찬?!
en: woochan?!

source: 건강하게… 울지 말고 기다려야 된다?
en: be well... and wait for me without crying, okay?

source: 만화부가 아니라 창작부야 등신아!!
en: it’s the creative club, not a cartoon club, you moron!!!

source: 야, 김우찬 괜찮아?!?
en: hey, woochan! you okay?!

source: 내 담당 일진 김세진을 부르자!!
en: let’s call sejin kim over! he bullies me...

source: 지금 저 귀신 심리엔…
en: right now, that ghost is thinking...

source: 떨떠름.
en: HMPH

source: 플래 카드 같은 거 혼자 들고 오면 불편하고 그러니까…
en: besides, placards are difficult to carry alone so--

source: 진주 너 맵찔이잖아
en: you aren’t good with spicy food, pearl.

source: 그럼 동네 정도만 해봐
en: then search the neighborhood.

source: 갑자기?!?
en: so suddenly?!

source: 집중하고 싶은데 귀찮게 굴긴…
en: I want to focus, but it keeps bothering me...

source: 싸아아
en: SMIRK

source: 들켜버렸네.
en: she found out.

source: 악귀지!!
en: it’s an evil spirit!!!

source: 친구야!!
en: hey, you!

source: 시시시간 한 번만 돌려주라 어제로!!!
en: c-c-can you send me back to yesterday? just once!!!

source: 무조건적인 관계는 사랑뿐이다.
en: only love is unconditional.

source: 그나저나 김우찬
en: by the way, woochan.

source: 제발 ㅈ까 넌
en: shut your trap, will you?

source: ㅁ ㄴ ㅇ ㄹ ㅎ ㅗ ㅓ
en: a s d f g h j

source: 너 능력자지?
en: you have a super power, don’t you?

source: 말해봐, 한다는 거지?
en: tell me. you’ll go, right?

source: 저, 저….
en: wh-what the-...

source: 안 그럼 이 정도로 안 끝낼 거니까.
en: otherwise, your beating won’t end here.

source: 되게 붙임성 좋은 애네
en: she’s really friendly.

source: 그런 …
en: that...

source: 응…?
en: huh?

source: 다들 포기했지만 나는 속으로 어디선가 계실거라 믿었다.
en: everyone gave up on him, but I continued to believe that he must be alive somewhere.

source: 그렇지?
en: right.

source: 일단 해라 끝
en: date someone. duh.

source: 적당히 때려!!
en: stop hitting me!!!

source: 다들 하니까 나도 해볼까 싶기도 하고
en: I’m wondering if I should just try ‘cause everyone else is doing it.

source: 야~이 씨ㅂ 너 최면걸었ㅈ…
en: hey! you f*cker! you hypnotized her, didn’t yo--

source: 된다!
en: I can!

source: 그렇지?!
en: aren’t we?!

source: 뭐… 제대로 성불시키면 문제없겠지
en: oh well. there shouldn’t be a problem as long as I send the ghost to heaven properly.

source: 아, 아니잇…!
en: b-but-!

source: 죽어?
en: am I dying?

source: 진심이야.
en: she’s serious.

source: 미안… 나중에 보면 인사해…
en: sorry... see you again later...

source: 톡톡톡
en: TAP TAP TAP

source: 너네 친하지?
en: you two are close, right?

source: 자∙∙∙ ∙∙∙ .
en: so...

source: 그나저나 아까 내가 잠깐 신고서 어디에 벗어놨지?
en: at any rate... I wore them for a bit earlier. where’d I leave them?

source: 역시 착각이었나…?
en: was I just imagining things?

source: 청소는?
en: we’re not done cleaning, though!

source: …뭐지…?
en: h...uh?

source: 솔직히 둘이 그러고 다니는 거 신경 쓰이기도 했고.
en: besides, seeing you two hanging out like that kind of bothered me.

source: 커흑!
en: ergh!

source: 당장!!
en: now!!!

source: 네가 뭘 안다고!!!
en: what do you know?!!!

source: 나라 전체를 뒤질 정도는 못해요!!
en: I’m not capable of searching the entire country!!!

source: 뭐, 뭔 소리 하려고 또
en: what are you gonna say this time?

source: 닥쳐!!
en: shut up!!

source: 그 쑥스러운 말이 세상을 움직인단다
en: those are the very words that light everything up...

source: 벌써?
en: already?

source: 돌린다고 니가 낼 것 같냐∙∙∙ ∙∙∙ ?
en: you wouldn’t turn it in even if you go back...

source: 김찬규?
en: chankyu?

source: 운명 이니까…
en: since it’s fate...

source: 미, 미안…!!
en: s-sorry!!!

source: 귀신!!
en: ghost!!!

source: 아
en: ugh.

source: 그 여자가 날 성불시킬 거야!!
en: that girl’s going to send me to heaven!!!

source: 고마워요…!
en: thank you!

source: 쌤!
en: teacher!

source: 저 어제 제출을 깜박해서∙∙∙ ∙∙∙ .
en: I forgot to turn this in yesterday... it slipped my mind...

source: 잠깐, 그러고 보니 너
en: wait, come to think of it,

source: 흐음…
en: hmm...

source: 네가 어떻게 나올지,
en: I know how you’ll react...

source: 그럼 기호 3번 정시완~!!
en: then, number three! siwan jeong!!!

source: 놀랐잖아!!
en: you scared me!!!

source: 자기까지 다치면서 그러는 건 바보 같아!
en: but it’s foolish to help while getting hurt yourself!

source: 저 부 좀 옮겨주세요
en: please assign me to a different club!

source: 네가 ㅈ나 쳐자고 있어서 자리 남는 부로 배정된 거임.
en: you were put in a leftover club because you were out cold.

source: 이유는 몰라도
en: whatever your reason...

source: 아니, 둘이 썸씽있는거 아니면 됐어
en: no, I’m good as long as they don’t have anything going on between them.

source: 완전 잊고 있었다∙∙∙ ∙∙∙ !!!
en: I totally forgot!!!

source: 귀신에 대해 잊어라
en: you will forget about the ghost.

source: 그런 …운명이었다
en: that... was my fate.

source: 아~ 좀 급한 일이 생각나서…
en: oh, I just remembered I have something to take care of...

source: 바라는 분은 아니겠지
en: I’m sure he wouldn’t want that.

source: 뭐냐 말을 왜 그렇게 해?
en: why are you talking about it like that?

source: 꺄아악!!
en: eeek!!!

source: 나는 어른이 되었다
en: and I became an adult.

source: 처음이라…
en: ...liking a boy.

source: 기억도 당연히 유지되지.
en: my memories will be intact, of course.

source: 미래를 봤다!
en: I saw the future!

source: 우선…주변의 여자애들 중 유력한 후보를추리해 보자!
en: first... let’s figure out which of the girls is most likely the owner!

source: 그렇지 않아
en: that’s not true.

source: 아직은 안돼…!
en: I can’t go yet!

source: 아까 신이가 말 좀 전해달라던데?
en: shin came by and asked me to tell you something.

source: 아무리 사랑에 미쳐도
en: no matter how deep in love I may be,

source: 맞아
en: yeah.

source: 의주 방금 나갔어, 방금.
en: euijoo left just now. literally right now.

source: 그래
en: okay.

source: 야 니 남자친구 지나간다
en: hey, look. your boyfriend.

source: 너도 알잖…
en: you already know...

source: 뭐야, 미정!
en: what the- mijung!

source: 우선 미진이 네가 모르는 게 있는데
en: first off, there’s stuff you don’t know, mijin.

source: 음… 사실…
en: um... to be honest...

source: 인력이 없어서 기초만 배우고 바로 투입이래
en: so once new recruits complete basic training, they’ll go straight to the fields.

source: 저 새끼도 손 다치고 그러거든?
en: but he still gets hurt all the time!

source: 결론은 아버지 시체를 찾으면…
en: you’re saying if you find your father’s body,

source: 누구 손 안 든 사람~ 남는 곳에 집어 넣는다?
en: who didn’t raise their hands? I’m putting them in the leftover clubs.

source: 앞날만 보자
en: let’s just think about the future.

source: 그랬나…
en: am I?

source: 얘기해 보고 말해줄게.
en: I’ll talk with her and let you know.

source: 야 쌤 불러와!
en: hey, get a teacher!

source: 지,진짜!?
en: r-really?!

source: 나랑 비슷한 정도 아닌가…?
en: but isn’t her power similar in strength to mine?

source: 뭐!?
en: what?!

source: 상담하러 왔는데…
en: I need some help...

source: 의리와 사랑은 종이 한장 차이다.
en: there is a very fine line between loyalty and love.

source: 흐으윽!
en: sob!

source: 앗 잠깐, 잠깐-!!
en: oh, wait! wait a sec!!!

source: 매일 도움만 받아…
en: instead, everyone is always helping me.

source: 야, 이 쓰레기야!!
en: ugh, you scumbag!!!

source: 어… 정미정 안녕.
en: uh... mijung... hi.

source: 여의주를 대하는 모든 순간에
en: he’s controlling euijoo’s super power...

source: 소담아, 사랑한다
en: sodam, I love you.

source: 부탁 좀 들어줘!!
en: do me a favor!!!

source: 연애 상담은 내 담당이다
en: I’m in charge of dating advice.

source: 의주야, 의주야
en: hey, euijoo!

source: 이걸 위해 기다렸다!!
en: I’ve been waiting for this!!!

source: 태, 태남아!
en: t-taenam!

source: 사실이지만
en: even though you’re right.

source: 인기 있으니까
en: “at least I’m popular.”

source: 의외다…
en: that’s unexpected...

source: 생각해 보면 울 아빠는 희생만 하고 남을 돕기만 하셨다
en: now that I think about it, he only helped others while sacrificing himself.

source: 감기냐?
en: did you catch a cold or something?

source: 알았어.
en: I’ll try.

source: 그래서… 어떻게 하면 좋을지 모르겠어서
en: so... I don’t know what I should do...

source: 자기의 의지랑은 별개로요
en: ...regardless of the superhuman’s intentions.

source: 미정이가 정색하는 건 첨 본다고!
en: I’ve never seen mijung get that offended!

source: 그게 뭔데!!
en: what’s that?!

source: 이새끼들 전부…!
en: these jerks!

source: 니 모습이 아니잖니
en: that’s not your real form.

source: 봄봄봄 봄이 없네요~
en: spring, spring, spring~ spring is gone~

source: 너한테 한번 뒤지고 돌아왔다 ㅆ발아
en: I came back from the dead because of you, *sshole!

source: 사락
en: SWISH

source: 왜 그런 연기를…?
en: why is she... acting like that?

source: 근데 죽음이 특별해지는 건
en: but how special that death is...

source: 아냐 같이 하는거잖아♥
en: oh, nooo... don’t say that. we both agreed to it!

source: 의주랑 미정~
en: euijoo and mijung!

source: 한순간 한순간 하는 게 아니라…
en: ...it means he isn’t doing it every now and then when he needs it.

source: 진짜 뒤진다, 니
en: you wanna die?

source: 내가 말하는 사람한테 빙의해 줘!
en: go possess the body of one of the girls at this school!

source: 2번 후보!
en: number two!

source: 어차피 돌아갈 건데 무슨상관이겠어.
en: why does that matter when I’m going back in time anyway?

source: 남자로 생각해도 내가 좋다?
en: would you like me as a man?

source: 그럼 해낼 수 있어
en: ...I can make it happen.

source: 수상한 느낌?
en: something strange?

source: 오히려 좋아.
en: this is actually better.

source: 그런 걸 언제 생각했다고
en: ...what condition either of us were in.

source: 다른 사람이랑 썸 타는 것 같아…
en: ...has been talking with another guy recently.

source: 그건
en: WELL

source: 기, 기다…
en: w-wait...

source: 떠보자고 ㅆㅂ
en: I’m saying, let’s go!

source: 제 취향도 생각해 주세요~
en: please respect what I like as well.

source: 까똑 까똑
en: DING DING

source: *오버 니삭스 :{j}종아리~허벅지까지 오는 양말
en: -{j}

source: 어차피 시간을 돌리면 너랑 나만 기억하는 거 아냐?
en: if you turn time back, only you and I will remember, right?

source: 아얏!ㅠㅠ
en: owww!!!

source: 이 귀신 아버지 몸은 찾을 수 없어?
en: can you find the body of this ghost’s father?

source: 연애에 대해 객관적으로 떨어져서 생각을 하기 때문이지!!!
en: because we can see relationships from an objective point of view!!!

source: 그런 것보다, 알려드리고 싶은 게 있어요
en: but that’s not important. I want to tell you about something.

source: 그럼 미정짱 아직 모쏠…!
en: then my lady mijung has never dated?!

source: 니 인생도
en: along with your life.

source: 미안해, 이런 이야기할 사람이 너 밖에 안 떠올랐어
en: sorry... I didn’t know who else I could confide in.

source: 전교 1등이라 성적 상담해 주라고 쌤들이 보냈다 무식한 안경 원숭아
en: and I rank first in the whole school, so the teachers sent me here to help other kids with their grades, you brainless four-eyed monkey.

source: 어…알았어… 엄청 다급하네 어딘데?
en: o-okay... you’re in such a rush. where do I go?

source: 그럼 그냥 다른 양말이었나 보다…
en: her socks must’ve been a different pair...

source: 너 왜 한쪽 맨발이야!?
en: why are you wearing only one sock?!

source: 빠자작.
en: RAGE

source: 네 고민은 별로 듣고 싶지 않은데…
en: I don’t really want to hear about your problems though...

source: 나 응원가도 돼??
en: can I go cheer for you?!

source: 아냐, 그런 거…
en: no, that isn’t it...

source: 어차피 내 귀신인데, 뭐!
en: well, you are my ghost!

source: 상벌 현황
en: Announcements

source: 네가 이 짓을 100번 반복할 게 아니라면
en: unless you repeat this at least a hundred times...

source: 자리에 없길래 내고 간 줄 알았더니.
en: you weren’t at your seat, so we thought you already turned yours in.

source: 목 안에 넣어줄게
en: I’ll put this...

source: 됐어, 나 상담 관둘게… 빠이~
en: forget it. I don’t want any advice. bye.

source: 마침 잘 만났다
en: just in time!

source: 이 ㅆ새끼야!!
en: you f*cking moron!

source: 참견할 생각은 없는데 너 말이야
en: I don’t plan on getting too involved...

source: 김준영 니가 여기 왜 있어 변ㅌ 뚱땡이 새끼야
en: junyoung, what the hell are you doing here, you perverted pig?

source: 예상했던 일이야
en: it didn’t come as a surprise.

source: 그림은 자기만족이야.
en: it’s for self-satisfaction.

source: 음?
en: hm?

source: 으…씨ㅂ…
en: ugh... f*ck...

source: … 뭐하나 알려줄까?
en: want me to tell you something else?

source: 쓰레기나 줍자…
en: I should just keep picking up trash...

source: 그러게 왜 무리하면서 도와줘…
en: why did you push yourself so much just to help?

source: 그리고 왜 좋아하는지…
en: why are you so excited?

source: 찬규야
en: chankyu.

source: 잠깐!
en: wait!

source: 응~
en: okay!

source: 그래도 혹시 몰라 축제니까 무슨 부스 같은 거 하겠지
en: who knows? it’s a festival. your club might host a booth.

source: 그나저나 어떻게 처리를…
en: but how should I get rid of--

source: 자, 잠깐!!
en: w-wait!!!

source: 꾸며야지∙∙∙ ∙∙∙ ∙∙∙ ∙∙∙ .
en: I should... dress up...

source: 우리가 도와주자고
en: ...so let’s help.

source: 7 영어 논술
en: 7 English Writing

source: 너무 못생겼잖아…
en: ...ugly.

source: 남겨졌어
en: and left him here.

source: 어쩔 수 없어!!
en: we can’t help it!

source: ㅈ됐다
en: you’re so f*cked.

source: 네!{j}네!
en: yes, master!{j}

source: 때론 슬픈 진실이..
en: sometimes, the brutal truth is--

source: 장난을 쳐도 그딴 장난을 치냐…!
en: you call that a joke?!

source: 웬일로 신이랑 같이 안 있지…
en: why isn’t she with shin?

source: 노력
en: EFFORT

source: 마세요…
en: don’t come to me...

source: 의주야, 나도 할 말 있는데
en: euijoo, I have something to tell you too.

source: 아가야, 뭐가 그렇게 슬프니?
en: hey, little girl. why are you so sad?

source: 뭔 소리야?
en: what are you talking about?

source: 여의주가…?!
en: she can do that?!

source: 6 체육 수학 음악 논술 체육
en: 6 PE Math Music Writing PE

source: 아~ 찬규랑 오늘만 이렇게 다니기로 했어!
en: oh! chankyu and I... agreed to spend the day like this!

source: 니삭스 때도 아무것도 예견하지 못해서 엿이나 먹고…
en: I couldn’t foresee anything about those knee socks either and made a total fool of myself...

source: 굳이 찾는 거 보면..
en: isn’t that why you made that announcement?

source: 네가 어떻고, 내가 어떻고
en: we never considered...

source: 맛있지?!
en: good, right?

source: 너는 뭐 생각도 못하게 하냐?
en: what, I can’t even think?

source: 최면이 아니야.
en: it’s not hypnosis.

source: 그러고 보니 요즘 신이가 통~ 안 보이네
en: come to think of it, I haven’t seen shin lately.

source: 뭐라는 거야…
en: what the hell is she saying...

source: 뭐해?{j}안 가고?
en: hey, why aren’t you going?{j}

source: 아-아- 방송부에서 알립니다 -!
en: mic check, one, two. this is an announcement from the broadcasting club!

source: 망했다…
en: I’m ruined...

source: 의주의 능력은 감정을 보는게 아닌, 용의 눈이에요.
en: it’s not emotions she’s reading. it’s the dragon’s eyes...

source: 무언가… 부딪혀온다…!!
en: something’s... coming!!!

source: 헤헤~ 이긴 것도 아닌데 호들갑은~ㅋㅋ
en: hehe! it’s not like I won or anything. don’t make such a fuss, lol.

source: 야 요즘 날씨 왜 이러냐
en: geez, what’s with this weather?

source: 응
en: yup.

source: 김찬규 저거 진짜 또 최면이라도 건거 아냐?
en: argh! chankyu must have hypnotized her again!

source: 야 그거 상금 10만 원이야
en: the prize is 100 dollars, you know!

source: 미, 미정아!
en: m-mijung!

source: 내 자존감 채우려고 연애 상대 찾는 거야
en: I’ve been looking for a potential boyfriend to feel better about myself,

source: 무대는 구경 가볼까…?
en: maybe I can go watch the performance...

source: 이번 게 제일 비중 크니까 잘 해서 내라~!
en: this one is the most important, so make sure to do well, okay?

source: 뭐, 용의 눈?
en: something about the dragon’s eyes?

source: 부끄러…워요…
en: you... make me shy...

source: 저 자식 설마…
en: that jerk can’t be...

source: 너의 미래가 보였으니까…
en: because I saw your future...

source: 다녀와~!
en: go on!

source: … 좆 됐다…!
en: I’m screwed!

source: 섭리에 맞지 않는…!
en: that goes against natural order-!

source: 이제 돌아갈 시간이다 추한 것
en: it’s time for you to disappear, you filthy being.

source: 그나저나…
en: but...

source: 아,응…
en: oh... yeah...

source: 뭐 그런 얘긴가
en: is that what he’s talking about?

source: 그렇긴 한데… 보통이랑은 좀 달라요
en: he does... but his is a little different.

source: 아니… 이렇게 사람이 많은데 쓰레기 줍는 게 의미가 있나?
en: ugh... what’s the use of picking up trash when there are so many people?

source: 아하하…
en: ahaha...

source: 능력증폭이 아니야…!!
en: isn’t amplifying other powers!!

source: ㅎㅎ 여친 자랑 이지ㅎㅎ
en: haha, I just wanted to brag about my girlfriend.

source: 저기… 번호 좀…
en: um... can I have... your number?

source: 미정이는 착하니까 괜찮지 않을까?
en: well, mijung’s nice so it should be okay...

source: 지배자의 자질이 있는 이에게 용의 힘을 내렸죠
en: it bestowed its power onto a human who had the potential to become a great ruler.

source: 운명이란다
en: it’s fate.

source: 아까 실수로 스타킹 올이 나가서 갈아입으려고
en: I got a hole in my tights earlier...

source: 으잉?
en: huh?!

source: 귀찮게 벌레가 꼬여가지고…
en: ...but these annoying bugs keep getting in the way!

source: 진짜… 진짜 미래였나?!
en: was it... really the future?!

source: 근데 덕분에 살았지ㅋㅋ
en: but our plan worked thanks to that, haha.

source: 깔깔~ 그래서~
en: hahaha! so...

source: 어∙∙∙ 어어∙∙∙ 제발∙∙∙ ∙∙∙ .
en: y-yeah... please...

source: 서울을 다 뒤져볼 수도 없고
en: it’s not like we can turn seoul inside out.

source: 사람을 사랑한 용은
en: since the dragon loved humans,

source: 그것보다…
en: it actually...

source: 설마 또…
en: she’d better not be gone again...

source: 달랑~
en: FLAP

source: 내가 이럴 줄 알았어!!
en: I knew she wouldn’t be here!!!

source: 그냥 다른 양말 신어~
en: just use a different pair of socks.

source: 요즘 영 보기가 힘드네
en: it’s so hard to get a hold of her recently.

source: 난 연애하는데?
en: I have a girlfriend.

source: 너 그 말 하려고 한 거지;;;
en: that’s what you really wanted to say, isn’t it...

source: 아무튼 회귀는 내가 한 게 아니라 미정이가 한 건데…
en: anyway. I’m not the one who went back in time. mijung sent me...

source: … 혹시 그 미정이란 애…
en: is the kid named mijung...

source: 저번에 어떻게 된 거야?
en: what happened that time?

source: 내가?
en: me?

source: 마침 보여서 막 말해버렸는데-
en: I said whatever came to mind because I saw him...

source: 못가
en: we can’t go.

source: 네가 말하니까 더 싫어졌어
en: now that you asked for it... I don’t want to!

source: 너…너…!
en: gh-ghost...!

source: 나도 이제 손 뗄 생각이거든
en: ...but I plan to take my hands off of this now.

source: 찬규야!
en: chankyu!

source: 시체조차 묻혀서 그 위엔 지금…
en: his body is underground now...

source: 이 학교에.
en: at this school?

source: 컥…!!
en: gag!

source: 으악, 얼굴이 왜 땀범벅이야??
en: whoa, why is your face drenched in sweat?!

source: 뭐해, 가자.
en: come on, let’s go.

source: 그건 뭐?
en: that’s what?

source: 봄이라고 의미부여 하지마라.
en: spring is nothing special.

source: 하지말라면 하지마 좀
en: stop when you’re told. please.

source: 사물함 위에 뜬금없이 있는데 쓰레기는 아닌가?
en: it’s just sitting on top of the cubbies... so it must not be trash, right?

source: 1 기술 기술
en: 1 Tech Tech

source: 의주 있어?
en: is euijoo here?

source: 그냥 다 끝나고 다 같이 한번에 치우면 되잖아 ㅆㅂ…
en: why can’t everyone just clean up together after it’s all over? d*mn it...

source: 겨우 그딴 걸로 위안 삼았어
en: that’s how I comforted myself.

source: 자, 잠깐만!!
en: w-wait!!!

source: 고작 그런 이유로 끼어들겠다고?
en: you’re interfering merely because of that?

source: 아무도 모르면…
en: if no one knows...

source: 미정아, 왜…
en: mijung...

source: 그에 따르는 일들도 당연하다 여겼다
en: ...so I thought it was natural to work with ghosts.

source: 이렇게… 물을 관계던가, 나랑?
en: for you to intervene between pearl and I?

source: 간단해 최면 걸면 되잖아
en: it’s simple. I can just hypnotize her.

source: 에휴…
en: ha...

source: 사실… 얼핏 보였다…
en: to be honest... I caught a glimpse of the future...

source: 말 그대로야.
en: exactly what I just said.

source: 그런거 아니야.
en: no, he didn’t.

source: 넌 꺼져 변태 돼지
en: get lost, you perverted pig.

source: 퍼걱
en: WHAM

source: 나도 이해해 줄 수 있을지도 몰라
en: ...because he just might understand me.

source: 꽝인데요.
en: sorry, try again.

source: 아니 고백도 안 했거든요--
en: nah. I didn’t even ask him out.

source: 니 여친 다리 부러졌는데, 넌 좀 괜찮아 보인다?
en: your girlfriend just broke her leg... but you look totally unfazed.

source: 뭐야
en: huh?

source: 아, 영어?
en: oh, for english?

source: 우리 집은 무당집이었다
en: I come from a shaman family.

source: 좋은 게 없네!!
en: that’s not an advantage!!!

source: 그럼… 의외로 재밌는 걸 할지도…?
en: then... maybe my club will do something fun too!

source: 응!
en: nope!

source: 한 명의 죽음은 비극이요, 백만 명의 죽음은 통계이다.
en: one person’s death is a tragedy, while a million deaths is a statistic.

source: …음?
en: huh?

source: 그게… 섭리니까…요…
en: because... that’s natural order... sir...

source: 왜 아까, 다들 능력이 증폭된 것 같다는 이야길 했었잖아요
en: you know earlier, when we all said our superpowers suddenly got stronger?

source: 왜 그렇게 놀라…?
en: why are you so surprised?

source: 계약 연애해볼 만한 사람이 있을 거야
en: I’m sure there’s someone you can contract date.

source: 가람아!!
en: garam!!!

source: …모르겠어…
en: I’m... not sure...

source: 어….
en: uh...

source: 여유?
en: confident?

source: 얼~ 유도 천재 이진주~~
en: oho! you’re a judo genius, pearl lee!

source: 아무리 내가…
en: I know I’m--

source: 가지가지한다…
en: what’s wrong with him?

source: 하필 이럴 때 타이밍까지 안 맞는 거야…
en: why isn’t she around right now of all times?

source: 아~ 너 미화부야
en: oh! you’re in the beautification club.

source: 아 ㅋ 잘생겨서 질투하는 줄
en: oh, haha. I thought you were jealous of his handsome face.
